garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f25q71.inc
// Register: DAC2DATL
#define DAC2DATL DAC2DATL
DAC2DATL                                 equ 00C0h
// bitfield definitions
DAC2DATL_DAC2R_POSN                      equ 0000h
DAC2DATL_DAC2R_POSITION                  equ 0000h
DAC2DATL_DAC2R_SIZE                      equ 0008h
DAC2DATL_DAC2R_LENGTH                    equ 0008h
DAC2DATL_DAC2R_MASK                      equ 00FFh
DAC2DATL_DAC2R0_POSN                     equ 0000h
DAC2DATL_DAC2R0_POSITION                 equ 0000h
DAC2DATL_DAC2R0_SIZE                     equ 0001h
DAC2DATL_DAC2R0_LENGTH                   equ 0001h
DAC2DATL_DAC2R0_MASK                     equ 0001h
DAC2DATL_DAC2R1_POSN                     equ 0001h
DAC2DATL_DAC2R1_POSITION                 equ 0001h
DAC2DATL_DAC2R1_SIZE                     equ 0001h
DAC2DATL_DAC2R1_LENGTH                   equ 0001h
DAC2DATL_DAC2R1_MASK                     equ 0002h
DAC2DATL_DAC2R2_POSN                     equ 0002h
DAC2DATL_DAC2R2_POSITION                 equ 0002h
DAC2DATL_DAC2R2_SIZE                     equ 0001h
DAC2DATL_DAC2R2_LENGTH                   equ 0001h
DAC2DATL_DAC2R2_MASK                     equ 0004h
DAC2DATL_DAC2R3_POSN                     equ 0003h
DAC2DATL_DAC2R3_POSITION                 equ 0003h
DAC2DATL_DAC2R3_SIZE                     equ 0001h
DAC2DATL_DAC2R3_LENGTH                   equ 0001h
DAC2DATL_DAC2R3_MASK                     equ 0008h
DAC2DATL_DAC2R4_POSN                     equ 0004h
DAC2DATL_DAC2R4_POSITION                 equ 0004h
DAC2DATL_DAC2R4_SIZE                     equ 0001h
DAC2DATL_DAC2R4_LENGTH                   equ 0001h
DAC2DATL_DAC2R4_MASK                     equ 0010h
DAC2DATL_DAC2R5_POSN                     equ 0005h
DAC2DATL_DAC2R5_POSITION                 equ 0005h
DAC2DATL_DAC2R5_SIZE                     equ 0001h
DAC2DATL_DAC2R5_LENGTH                   equ 0001h
DAC2DATL_DAC2R5_MASK                     equ 0020h
DAC2DATL_DAC2R6_POSN                     equ 0006h
DAC2DATL_DAC2R6_POSITION                 equ 0006h
DAC2DATL_DAC2R6_SIZE                     equ 0001h
DAC2DATL_DAC2R6_LENGTH                   equ 0001h
DAC2DATL_DAC2R6_MASK                     equ 0040h
DAC2DATL_DAC2R7_POSN                     equ 0007h
DAC2DATL_DAC2R7_POSITION                 equ 0007h
DAC2DATL_DAC2R7_SIZE                     equ 0001h
DAC2DATL_DAC2R7_LENGTH                   equ 0001h
DAC2DATL_DAC2R7_MASK                     equ 0080h
DAC2DATL_DAC2RL_POSN                     equ 0000h
DAC2DATL_DAC2RL_POSITION                 equ 0000h
DAC2DATL_DAC2RL_SIZE                     equ 0008h
DAC2DATL_DAC2RL_LENGTH                   equ 0008h
DAC2DATL_DAC2RL_MASK                     equ 00FFh

// Register: DAC2CON
#define DAC2CON DAC2CON
DAC2CON                                  equ 00C2h
// bitfield definitions
DAC2CON_NSS_POSN                         equ 0000h
DAC2CON_NSS_POSITION                     equ 0000h
DAC2CON_NSS_SIZE                         equ 0002h
DAC2CON_NSS_LENGTH                       equ 0002h
DAC2CON_NSS_MASK                         equ 0003h
DAC2CON_PSS_POSN                         equ 0002h
DAC2CON_PSS_POSITION                     equ 0002h
DAC2CON_PSS_SIZE                         equ 0002h
DAC2CON_PSS_LENGTH                       equ 0002h
DAC2CON_PSS_MASK                         equ 000Ch
DAC2CON_OE_POSN                          equ 0004h
DAC2CON_OE_POSITION                      equ 0004h
DAC2CON_OE_SIZE                          equ 0003h
DAC2CON_OE_LENGTH                        equ 0003h
DAC2CON_OE_MASK                          equ 0070h
DAC2CON_EN_POSN                          equ 0007h
DAC2CON_EN_POSITION                      equ 0007h
DAC2CON_EN_SIZE                          equ 0001h
DAC2CON_EN_LENGTH                        equ 0001h
DAC2CON_EN_MASK                          equ 0080h
DAC2CON_DAC2NSS_POSN                     equ 0000h
DAC2CON_DAC2NSS_POSITION                 equ 0000h
DAC2CON_DAC2NSS_SIZE                     equ 0002h
DAC2CON_DAC2NSS_LENGTH                   equ 0002h
DAC2CON_DAC2NSS_MASK                     equ 0003h
DAC2CON_DAC2PSS0_POSN                    equ 0002h
DAC2CON_DAC2PSS0_POSITION                equ 0002h
DAC2CON_DAC2PSS0_SIZE                    equ 0001h
DAC2CON_DAC2PSS0_LENGTH                  equ 0001h
DAC2CON_DAC2PSS0_MASK                    equ 0004h
DAC2CON_DAC2PSS1_POSN                    equ 0003h
DAC2CON_DAC2PSS1_POSITION                equ 0003h
DAC2CON_DAC2PSS1_SIZE                    equ 0001h
DAC2CON_DAC2PSS1_LENGTH                  equ 0001h
DAC2CON_DAC2PSS1_MASK                    equ 0008h
DAC2CON_DAC2OE_POSN                      equ 0004h
DAC2CON_DAC2OE_POSITION                  equ 0004h
DAC2CON_DAC2OE_SIZE                      equ 0003h
DAC2CON_DAC2OE_LENGTH                    equ 0003h
DAC2CON_DAC2OE_MASK                      equ 0070h
DAC2CON_DAC2EN_POSN                      equ 0007h
DAC2CON_DAC2EN_POSITION                  equ 0007h
DAC2CON_DAC2EN_SIZE                      equ 0001h
DAC2CON_DAC2EN_LENGTH                    equ 0001h
DAC2CON_DAC2EN_MASK                      equ 0080h
DAC2CON_NSS0_POSN                        equ 0000h
DAC2CON_NSS0_POSITION                    equ 0000h
DAC2CON_NSS0_SIZE                        equ 0001h
DAC2CON_NSS0_LENGTH                      equ 0001h
DAC2CON_NSS0_MASK                        equ 0001h
DAC2CON_PSS0_POSN                        equ 0002h
DAC2CON_PSS0_POSITION                    equ 0002h
DAC2CON_PSS0_SIZE                        equ 0001h
DAC2CON_PSS0_LENGTH                      equ 0001h
DAC2CON_PSS0_MASK                        equ 0004h
DAC2CON_PSS1_POSN                        equ 0003h
DAC2CON_PSS1_POSITION                    equ 0003h
DAC2CON_PSS1_SIZE                        equ 0001h
DAC2CON_PSS1_LENGTH                      equ 0001h
DAC2CON_PSS1_MASK                        equ 0008h
DAC2CON_OE0_POSN                         equ 0004h
DAC2CON_OE0_POSITION                     equ 0004h
DAC2CON_OE0_SIZE                         equ 0001h
DAC2CON_OE0_LENGTH                       equ 0001h
DAC2CON_OE0_MASK                         equ 0010h
DAC2CON_OE1_POSN                         equ 0005h
DAC2CON_OE1_POSITION                     equ 0005h
DAC2CON_OE1_SIZE                         equ 0001h
DAC2CON_OE1_LENGTH                       equ 0001h
DAC2CON_OE1_MASK                         equ 0020h

// Register: DAC3DAT
#define DAC3DAT DAC3DAT
DAC3DAT                                  equ 00C3h

