garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f25q71.inc
// Register: PWMIN0PPS
#define PWMIN0PPS PWMIN0PPS
PWMIN0PPS                                equ 0257h
// bitfield definitions
PWMIN0PPS_PIN_POSN                       equ 0000h
PWMIN0PPS_PIN_POSITION                   equ 0000h
PWMIN0PPS_PIN_SIZE                       equ 0003h
PWMIN0PPS_PIN_LENGTH                     equ 0003h
PWMIN0PPS_PIN_MASK                       equ 0007h
PWMIN0PPS_PORT_POSN                      equ 0003h
PWMIN0PPS_PORT_POSITION                  equ 0003h
PWMIN0PPS_PORT_SIZE                      equ 0003h
PWMIN0PPS_PORT_LENGTH                    equ 0003h
PWMIN0PPS_PORT_MASK                      equ 0038h
PWMIN0PPS_PWMIN0PPS0_POSN                equ 0000h
PWMIN0PPS_PWMIN0PPS0_POSITION            equ 0000h
PWMIN0PPS_PWMIN0PPS0_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS0_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS0_MASK                equ 0001h
PWMIN0PPS_PWMIN0PPS1_POSN                equ 0001h
PWMIN0PPS_PWMIN0PPS1_POSITION            equ 0001h
PWMIN0PPS_PWMIN0PPS1_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS1_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS1_MASK                equ 0002h
PWMIN0PPS_PWMIN0PPS2_POSN                equ 0002h
PWMIN0PPS_PWMIN0PPS2_POSITION            equ 0002h
PWMIN0PPS_PWMIN0PPS2_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS2_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS2_MASK                equ 0004h
PWMIN0PPS_PWMIN0PPS3_POSN                equ 0003h
PWMIN0PPS_PWMIN0PPS3_POSITION            equ 0003h
PWMIN0PPS_PWMIN0PPS3_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS3_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS3_MASK                equ 0008h
PWMIN0PPS_PWMIN0PPS4_POSN                equ 0004h
PWMIN0PPS_PWMIN0PPS4_POSITION            equ 0004h
PWMIN0PPS_PWMIN0PPS4_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS4_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS4_MASK                equ 0010h
PWMIN0PPS_PWMIN0PPS5_POSN                equ 0005h
PWMIN0PPS_PWMIN0PPS5_POSITION            equ 0005h
PWMIN0PPS_PWMIN0PPS5_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS5_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS5_MASK                equ 0020h
PWMIN0PPS_PWMIN0PPS_POSN                 equ 0000h
PWMIN0PPS_PWMIN0PPS_POSITION             equ 0000h
PWMIN0PPS_PWMIN0PPS_SIZE                 equ 0006h
PWMIN0PPS_PWMIN0PPS_LENGTH               equ 0006h
PWMIN0PPS_PWMIN0PPS_MASK                 equ 003Fh

// Register: PWMIN1PPS
#define PWMIN1PPS PWMIN1PPS
PWMIN1PPS                                equ 0258h
// bitfield definitions
PWMIN1PPS_PIN_POSN                       equ 0000h
PWMIN1PPS_PIN_POSITION                   equ 0000h
PWMIN1PPS_PIN_SIZE                       equ 0003h
PWMIN1PPS_PIN_LENGTH                     equ 0003h
PWMIN1PPS_PIN_MASK                       equ 0007h
PWMIN1PPS_PORT_POSN                      equ 0003h
PWMIN1PPS_PORT_POSITION                  equ 0003h
PWMIN1PPS_PORT_SIZE                      equ 0003h
PWMIN1PPS_PORT_LENGTH                    equ 0003h
PWMIN1PPS_PORT_MASK                      equ 0038h
PWMIN1PPS_PWMIN1PPS0_POSN                equ 0000h
PWMIN1PPS_PWMIN1PPS0_POSITION            equ 0000h
PWMIN1PPS_PWMIN1PPS0_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS0_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS0_MASK                equ 0001h
PWMIN1PPS_PWMIN1PPS1_POSN                equ 0001h
PWMIN1PPS_PWMIN1PPS1_POSITION            equ 0001h
PWMIN1PPS_PWMIN1PPS1_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS1_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS1_MASK                equ 0002h
PWMIN1PPS_PWMIN1PPS2_POSN                equ 0002h
PWMIN1PPS_PWMIN1PPS2_POSITION            equ 0002h
PWMIN1PPS_PWMIN1PPS2_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS2_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS2_MASK                equ 0004h
PWMIN1PPS_PWMIN1PPS3_POSN                equ 0003h
PWMIN1PPS_PWMIN1PPS3_POSITION            equ 0003h
PWMIN1PPS_PWMIN1PPS3_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS3_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS3_MASK                equ 0008h
PWMIN1PPS_PWMIN1PPS4_POSN                equ 0004h
PWMIN1PPS_PWMIN1PPS4_POSITION            equ 0004h
PWMIN1PPS_PWMIN1PPS4_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS4_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS4_MASK                equ 0010h
PWMIN1PPS_PWMIN1PPS5_POSN                equ 0005h
PWMIN1PPS_PWMIN1PPS5_POSITION            equ 0005h
PWMIN1PPS_PWMIN1PPS5_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS5_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS5_MASK                equ 0020h
PWMIN1PPS_PWMIN1PPS_POSN                 equ 0000h
PWMIN1PPS_PWMIN1PPS_POSITION             equ 0000h
PWMIN1PPS_PWMIN1PPS_SIZE                 equ 0006h
PWMIN1PPS_PWMIN1PPS_LENGTH               equ 0006h
PWMIN1PPS_PWMIN1PPS_MASK                 equ 003Fh

// Register: CWG1PPS
#define CWG1PPS CWG1PPS
CWG1PPS                                  equ 025Bh
// bitfield definitions
CWG1PPS_PIN_POSN                         equ 0000h
CWG1PPS_PIN_POSITION                     equ 0000h
CWG1PPS_PIN_SIZE                         equ 0003h
CWG1PPS_PIN_LENGTH                       equ 0003h
CWG1PPS_PIN_MASK                         equ 0007h
CWG1PPS_PORT_POSN                        equ 0003h
CWG1PPS_PORT_POSITION                    equ 0003h
CWG1PPS_PORT_SIZE                        equ 0003h
CWG1PPS_PORT_LENGTH                      equ 0003h
CWG1PPS_PORT_MASK                        equ 0038h
CWG1PPS_CWGINPPS0_POSN                   equ 0000h
CWG1PPS_CWGINPPS0_POSITION               equ 0000h
CWG1PPS_CWGINPPS0_SIZE                   equ 0001h
CWG1PPS_CWGINPPS0_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS0_MASK                   equ 0001h
CWG1PPS_CWGINPPS1_POSN                   equ 0001h
CWG1PPS_CWGINPPS1_POSITION               equ 0001h
CWG1PPS_CWGINPPS1_SIZE                   equ 0001h
CWG1PPS_CWGINPPS1_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS1_MASK                   equ 0002h
CWG1PPS_CWGINPPS2_POSN                   equ 0002h
CWG1PPS_CWGINPPS2_POSITION               equ 0002h
CWG1PPS_CWGINPPS2_SIZE                   equ 0001h
CWG1PPS_CWGINPPS2_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS2_MASK                   equ 0004h
CWG1PPS_CWGINPPS3_POSN                   equ 0003h
CWG1PPS_CWGINPPS3_POSITION               equ 0003h
CWG1PPS_CWGINPPS3_SIZE                   equ 0001h
CWG1PPS_CWGINPPS3_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS3_MASK                   equ 0008h
CWG1PPS_CWGINPPS4_POSN                   equ 0004h
CWG1PPS_CWGINPPS4_POSITION               equ 0004h
CWG1PPS_CWGINPPS4_SIZE                   equ 0001h
CWG1PPS_CWGINPPS4_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS4_MASK                   equ 0010h
CWG1PPS_CWGINPPS5_POSN                   equ 0005h
CWG1PPS_CWGINPPS5_POSITION               equ 0005h
CWG1PPS_CWGINPPS5_SIZE                   equ 0001h
CWG1PPS_CWGINPPS5_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS5_MASK                   equ 0020h
CWG1PPS_CWG1INPPS_POSN                   equ 0000h
CWG1PPS_CWG1INPPS_POSITION               equ 0000h
CWG1PPS_CWG1INPPS_SIZE                   equ 0006h
CWG1PPS_CWG1INPPS_LENGTH                 equ 0006h
CWG1PPS_CWG1INPPS_MASK                   equ 003Fh
CWG1PPS_CWG1INPPS0_POSN                  equ 0000h
CWG1PPS_CWG1INPPS0_POSITION              equ 0000h
CWG1PPS_CWG1INPPS0_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS0_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS0_MASK                  equ 0001h
CWG1PPS_CWG1INPPS1_POSN                  equ 0001h
CWG1PPS_CWG1INPPS1_POSITION              equ 0001h
CWG1PPS_CWG1INPPS1_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS1_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS1_MASK                  equ 0002h
CWG1PPS_CWG1INPPS2_POSN                  equ 0002h
CWG1PPS_CWG1INPPS2_POSITION              equ 0002h
CWG1PPS_CWG1INPPS2_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS2_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS2_MASK                  equ 0004h
CWG1PPS_CWG1INPPS3_POSN                  equ 0003h
CWG1PPS_CWG1INPPS3_POSITION              equ 0003h
CWG1PPS_CWG1INPPS3_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS3_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS3_MASK                  equ 0008h
CWG1PPS_CWG1INPPS4_POSN                  equ 0004h
CWG1PPS_CWG1INPPS4_POSITION              equ 0004h
CWG1PPS_CWG1INPPS4_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS4_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS4_MASK                  equ 0010h
CWG1PPS_CWG1INPPS5_POSN                  equ 0005h
CWG1PPS_CWG1INPPS5_POSITION              equ 0005h
CWG1PPS_CWG1INPPS5_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS5_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS5_MASK                  equ 0020h
CWG1PPS_CWGINPPS_POSN                    equ 0000h
CWG1PPS_CWGINPPS_POSITION                equ 0000h
CWG1PPS_CWGINPPS_SIZE                    equ 0006h
CWG1PPS_CWGINPPS_LENGTH                  equ 0006h
CWG1PPS_CWGINPPS_MASK                    equ 003Fh

