garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f25q71.inc
// Register: TU16BCRL
#define TU16BCRL TU16BCRL
TU16BCRL                                 equ 03AEh
// bitfield definitions
TU16BCRL_CRL_POSN                        equ 0000h
TU16BCRL_CRL_POSITION                    equ 0000h
TU16BCRL_CRL_SIZE                        equ 0008h
TU16BCRL_CRL_LENGTH                      equ 0008h
TU16BCRL_CRL_MASK                        equ 00FFh
TU16BCRL_CRL0_POSN                       equ 0000h
TU16BCRL_CRL0_POSITION                   equ 0000h
TU16BCRL_CRL0_SIZE                       equ 0001h
TU16BCRL_CRL0_LENGTH                     equ 0001h
TU16BCRL_CRL0_MASK                       equ 0001h
TU16BCRL_CRL1_POSN                       equ 0001h
TU16BCRL_CRL1_POSITION                   equ 0001h
TU16BCRL_CRL1_SIZE                       equ 0001h
TU16BCRL_CRL1_LENGTH                     equ 0001h
TU16BCRL_CRL1_MASK                       equ 0002h
TU16BCRL_CRL2_POSN                       equ 0002h
TU16BCRL_CRL2_POSITION                   equ 0002h
TU16BCRL_CRL2_SIZE                       equ 0001h
TU16BCRL_CRL2_LENGTH                     equ 0001h
TU16BCRL_CRL2_MASK                       equ 0004h
TU16BCRL_CRL3_POSN                       equ 0003h
TU16BCRL_CRL3_POSITION                   equ 0003h
TU16BCRL_CRL3_SIZE                       equ 0001h
TU16BCRL_CRL3_LENGTH                     equ 0001h
TU16BCRL_CRL3_MASK                       equ 0008h
TU16BCRL_CRL4_POSN                       equ 0004h
TU16BCRL_CRL4_POSITION                   equ 0004h
TU16BCRL_CRL4_SIZE                       equ 0001h
TU16BCRL_CRL4_LENGTH                     equ 0001h
TU16BCRL_CRL4_MASK                       equ 0010h
TU16BCRL_CRL5_POSN                       equ 0005h
TU16BCRL_CRL5_POSITION                   equ 0005h
TU16BCRL_CRL5_SIZE                       equ 0001h
TU16BCRL_CRL5_LENGTH                     equ 0001h
TU16BCRL_CRL5_MASK                       equ 0020h
TU16BCRL_CRL6_POSN                       equ 0006h
TU16BCRL_CRL6_POSITION                   equ 0006h
TU16BCRL_CRL6_SIZE                       equ 0001h
TU16BCRL_CRL6_LENGTH                     equ 0001h
TU16BCRL_CRL6_MASK                       equ 0040h
TU16BCRL_CRL7_POSN                       equ 0007h
TU16BCRL_CRL7_POSITION                   equ 0007h
TU16BCRL_CRL7_SIZE                       equ 0001h
TU16BCRL_CRL7_LENGTH                     equ 0001h
TU16BCRL_CRL7_MASK                       equ 0080h
TU16BCRL_TU16BCRL0_POSN                  equ 0000h
TU16BCRL_TU16BCRL0_POSITION              equ 0000h
TU16BCRL_TU16BCRL0_SIZE                  equ 0001h
TU16BCRL_TU16BCRL0_LENGTH                equ 0001h
TU16BCRL_TU16BCRL0_MASK                  equ 0001h
TU16BCRL_TU16BCRL1_POSN                  equ 0001h
TU16BCRL_TU16BCRL1_POSITION              equ 0001h
TU16BCRL_TU16BCRL1_SIZE                  equ 0001h
TU16BCRL_TU16BCRL1_LENGTH                equ 0001h
TU16BCRL_TU16BCRL1_MASK                  equ 0002h
TU16BCRL_TU16BCRL2_POSN                  equ 0002h
TU16BCRL_TU16BCRL2_POSITION              equ 0002h
TU16BCRL_TU16BCRL2_SIZE                  equ 0001h
TU16BCRL_TU16BCRL2_LENGTH                equ 0001h
TU16BCRL_TU16BCRL2_MASK                  equ 0004h
TU16BCRL_TU16BCRL3_POSN                  equ 0003h
TU16BCRL_TU16BCRL3_POSITION              equ 0003h
TU16BCRL_TU16BCRL3_SIZE                  equ 0001h
TU16BCRL_TU16BCRL3_LENGTH                equ 0001h
TU16BCRL_TU16BCRL3_MASK                  equ 0008h
TU16BCRL_TU16BCRL4_POSN                  equ 0004h
TU16BCRL_TU16BCRL4_POSITION              equ 0004h
TU16BCRL_TU16BCRL4_SIZE                  equ 0001h
TU16BCRL_TU16BCRL4_LENGTH                equ 0001h
TU16BCRL_TU16BCRL4_MASK                  equ 0010h
TU16BCRL_TU16BCRL5_POSN                  equ 0005h
TU16BCRL_TU16BCRL5_POSITION              equ 0005h
TU16BCRL_TU16BCRL5_SIZE                  equ 0001h
TU16BCRL_TU16BCRL5_LENGTH                equ 0001h
TU16BCRL_TU16BCRL5_MASK                  equ 0020h
TU16BCRL_TU16BCRL6_POSN                  equ 0006h
TU16BCRL_TU16BCRL6_POSITION              equ 0006h
TU16BCRL_TU16BCRL6_SIZE                  equ 0001h
TU16BCRL_TU16BCRL6_LENGTH                equ 0001h
TU16BCRL_TU16BCRL6_MASK                  equ 0040h
TU16BCRL_TU16BCRL7_POSN                  equ 0007h
TU16BCRL_TU16BCRL7_POSITION              equ 0007h
TU16BCRL_TU16BCRL7_SIZE                  equ 0001h
TU16BCRL_TU16BCRL7_LENGTH                equ 0001h
TU16BCRL_TU16BCRL7_MASK                  equ 0080h
TU16BCRL_TU16BCR0_POSN                   equ 0000h
TU16BCRL_TU16BCR0_POSITION               equ 0000h
TU16BCRL_TU16BCR0_SIZE                   equ 0001h
TU16BCRL_TU16BCR0_LENGTH                 equ 0001h
TU16BCRL_TU16BCR0_MASK                   equ 0001h
TU16BCRL_TU16BCR1_POSN                   equ 0001h
TU16BCRL_TU16BCR1_POSITION               equ 0001h
TU16BCRL_TU16BCR1_SIZE                   equ 0001h
TU16BCRL_TU16BCR1_LENGTH                 equ 0001h
TU16BCRL_TU16BCR1_MASK                   equ 0002h
TU16BCRL_TU16BCR2_POSN                   equ 0002h
TU16BCRL_TU16BCR2_POSITION               equ 0002h
TU16BCRL_TU16BCR2_SIZE                   equ 0001h
TU16BCRL_TU16BCR2_LENGTH                 equ 0001h
TU16BCRL_TU16BCR2_MASK                   equ 0004h
TU16BCRL_TU16BCR3_POSN                   equ 0003h
TU16BCRL_TU16BCR3_POSITION               equ 0003h
TU16BCRL_TU16BCR3_SIZE                   equ 0001h
TU16BCRL_TU16BCR3_LENGTH                 equ 0001h
TU16BCRL_TU16BCR3_MASK                   equ 0008h
TU16BCRL_TU16BCR4_POSN                   equ 0004h
TU16BCRL_TU16BCR4_POSITION               equ 0004h
TU16BCRL_TU16BCR4_SIZE                   equ 0001h
TU16BCRL_TU16BCR4_LENGTH                 equ 0001h
TU16BCRL_TU16BCR4_MASK                   equ 0010h
TU16BCRL_TU16BCR5_POSN                   equ 0005h
TU16BCRL_TU16BCR5_POSITION               equ 0005h
TU16BCRL_TU16BCR5_SIZE                   equ 0001h
TU16BCRL_TU16BCR5_LENGTH                 equ 0001h
TU16BCRL_TU16BCR5_MASK                   equ 0020h
TU16BCRL_TU16BCR6_POSN                   equ 0006h
TU16BCRL_TU16BCR6_POSITION               equ 0006h
TU16BCRL_TU16BCR6_SIZE                   equ 0001h
TU16BCRL_TU16BCR6_LENGTH                 equ 0001h
TU16BCRL_TU16BCR6_MASK                   equ 0040h
TU16BCRL_TU16BCR7_POSN                   equ 0007h
TU16BCRL_TU16BCR7_POSITION               equ 0007h
TU16BCRL_TU16BCR7_SIZE                   equ 0001h
TU16BCRL_TU16BCR7_LENGTH                 equ 0001h
TU16BCRL_TU16BCR7_MASK                   equ 0080h

// Register: TU16BTMRH
#define TU16BTMRH TU16BTMRH
TU16BTMRH                                equ 03AFh
// bitfield definitions
TU16BTMRH_TMRH_POSN                      equ 0000h
TU16BTMRH_TMRH_POSITION                  equ 0000h
TU16BTMRH_TMRH_SIZE                      equ 0008h
TU16BTMRH_TMRH_LENGTH                    equ 0008h
TU16BTMRH_TMRH_MASK                      equ 00FFh
TU16BTMRH_TMRH0_POSN                     equ 0000h
TU16BTMRH_TMRH0_POSITION                 equ 0000h
TU16BTMRH_TMRH0_SIZE                     equ 0001h
TU16BTMRH_TMRH0_LENGTH                   equ 0001h
TU16BTMRH_TMRH0_MASK                     equ 0001h
TU16BTMRH_TMRH1_POSN                     equ 0001h
TU16BTMRH_TMRH1_POSITION                 equ 0001h
TU16BTMRH_TMRH1_SIZE                     equ 0001h
TU16BTMRH_TMRH1_LENGTH                   equ 0001h
TU16BTMRH_TMRH1_MASK                     equ 0002h
TU16BTMRH_TMRH2_POSN                     equ 0002h
TU16BTMRH_TMRH2_POSITION                 equ 0002h
TU16BTMRH_TMRH2_SIZE                     equ 0001h
TU16BTMRH_TMRH2_LENGTH                   equ 0001h
TU16BTMRH_TMRH2_MASK                     equ 0004h
TU16BTMRH_TMRH3_POSN                     equ 0003h
TU16BTMRH_TMRH3_POSITION                 equ 0003h
TU16BTMRH_TMRH3_SIZE                     equ 0001h
TU16BTMRH_TMRH3_LENGTH                   equ 0001h
TU16BTMRH_TMRH3_MASK                     equ 0008h
TU16BTMRH_TMRH4_POSN                     equ 0004h
TU16BTMRH_TMRH4_POSITION                 equ 0004h
TU16BTMRH_TMRH4_SIZE                     equ 0001h
TU16BTMRH_TMRH4_LENGTH                   equ 0001h
TU16BTMRH_TMRH4_MASK                     equ 0010h
TU16BTMRH_TMRH5_POSN                     equ 0005h
TU16BTMRH_TMRH5_POSITION                 equ 0005h
TU16BTMRH_TMRH5_SIZE                     equ 0001h
TU16BTMRH_TMRH5_LENGTH                   equ 0001h
TU16BTMRH_TMRH5_MASK                     equ 0020h
TU16BTMRH_TMRH6_POSN                     equ 0006h
TU16BTMRH_TMRH6_POSITION                 equ 0006h
TU16BTMRH_TMRH6_SIZE                     equ 0001h
TU16BTMRH_TMRH6_LENGTH                   equ 0001h
TU16BTMRH_TMRH6_MASK                     equ 0040h
TU16BTMRH_TMRH7_POSN                     equ 0007h
TU16BTMRH_TMRH7_POSITION                 equ 0007h
TU16BTMRH_TMRH7_SIZE                     equ 0001h
TU16BTMRH_TMRH7_LENGTH                   equ 0001h
TU16BTMRH_TMRH7_MASK                     equ 0080h
TU16BTMRH_TU16BTMRH0_POSN                equ 0000h
TU16BTMRH_TU16BTMRH0_POSITION            equ 0000h
TU16BTMRH_TU16BTMRH0_SIZE                equ 0001h
TU16BTMRH_TU16BTMRH0_LENGTH              equ 0001h
TU16BTMRH_TU16BTMRH0_MASK                equ 0001h
TU16BTMRH_TU16BTMRH1_POSN                equ 0001h
TU16BTMRH_TU16BTMRH1_POSITION            equ 0001h
TU16BTMRH_TU16BTMRH1_SIZE                equ 0001h
TU16BTMRH_TU16BTMRH1_LENGTH              equ 0001h
TU16BTMRH_TU16BTMRH1_MASK                equ 0002h
TU16BTMRH_TU16BTMRH2_POSN                equ 0002h
TU16BTMRH_TU16BTMRH2_POSITION            equ 0002h
TU16BTMRH_TU16BTMRH2_SIZE                equ 0001h
TU16BTMRH_TU16BTMRH2_LENGTH              equ 0001h
TU16BTMRH_TU16BTMRH2_MASK                equ 0004h
TU16BTMRH_TU16BTMRH3_POSN                equ 0003h
TU16BTMRH_TU16BTMRH3_POSITION            equ 0003h
TU16BTMRH_TU16BTMRH3_SIZE                equ 0001h
TU16BTMRH_TU16BTMRH3_LENGTH              equ 0001h
TU16BTMRH_TU16BTMRH3_MASK                equ 0008h
TU16BTMRH_TU16BTMRH4_POSN                equ 0004h
TU16BTMRH_TU16BTMRH4_POSITION            equ 0004h
TU16BTMRH_TU16BTMRH4_SIZE                equ 0001h
TU16BTMRH_TU16BTMRH4_LENGTH              equ 0001h
TU16BTMRH_TU16BTMRH4_MASK                equ 0010h
TU16BTMRH_TU16BTMRH5_POSN                equ 0005h
TU16BTMRH_TU16BTMRH5_POSITION            equ 0005h
TU16BTMRH_TU16BTMRH5_SIZE                equ 0001h
TU16BTMRH_TU16BTMRH5_LENGTH              equ 0001h
TU16BTMRH_TU16BTMRH5_MASK                equ 0020h
TU16BTMRH_TU16BTMRH6_POSN                equ 0006h
TU16BTMRH_TU16BTMRH6_POSITION            equ 0006h
TU16BTMRH_TU16BTMRH6_SIZE                equ 0001h
TU16BTMRH_TU16BTMRH6_LENGTH              equ 0001h
TU16BTMRH_TU16BTMRH6_MASK                equ 0040h
TU16BTMRH_TU16BTMRH7_POSN                equ 0007h
TU16BTMRH_TU16BTMRH7_POSITION            equ 0007h
TU16BTMRH_TU16BTMRH7_SIZE                equ 0001h
TU16BTMRH_TU16BTMRH7_LENGTH              equ 0001h
TU16BTMRH_TU16BTMRH7_MASK                equ 0080h
TU16BTMRH_TU16BTMR8_POSN                 equ 0000h
TU16BTMRH_TU16BTMR8_POSITION             equ 0000h
TU16BTMRH_TU16BTMR8_SIZE                 equ 0001h
TU16BTMRH_TU16BTMR8_LENGTH               equ 0001h
TU16BTMRH_TU16BTMR8_MASK                 equ 0001h
TU16BTMRH_TU16BTMR9_POSN                 equ 0001h
TU16BTMRH_TU16BTMR9_POSITION             equ 0001h
TU16BTMRH_TU16BTMR9_SIZE                 equ 0001h
TU16BTMRH_TU16BTMR9_LENGTH               equ 0001h
TU16BTMRH_TU16BTMR9_MASK                 equ 0002h
TU16BTMRH_TU16BTMR10_POSN                equ 0002h
TU16BTMRH_TU16BTMR10_POSITION            equ 0002h
TU16BTMRH_TU16BTMR10_SIZE                equ 0001h
TU16BTMRH_TU16BTMR10_LENGTH              equ 0001h
TU16BTMRH_TU16BTMR10_MASK                equ 0004h
TU16BTMRH_TU16BTMR11_POSN                equ 0003h
TU16BTMRH_TU16BTMR11_POSITION            equ 0003h
TU16BTMRH_TU16BTMR11_SIZE                equ 0001h
TU16BTMRH_TU16BTMR11_LENGTH              equ 0001h
TU16BTMRH_TU16BTMR11_MASK                equ 0008h
TU16BTMRH_TU16BTMR12_POSN                equ 0004h
TU16BTMRH_TU16BTMR12_POSITION            equ 0004h
TU16BTMRH_TU16BTMR12_SIZE                equ 0001h
TU16BTMRH_TU16BTMR12_LENGTH              equ 0001h
TU16BTMRH_TU16BTMR12_MASK                equ 0010h
TU16BTMRH_TU16BTMR13_POSN                equ 0005h
TU16BTMRH_TU16BTMR13_POSITION            equ 0005h
TU16BTMRH_TU16BTMR13_SIZE                equ 0001h
TU16BTMRH_TU16BTMR13_LENGTH              equ 0001h
TU16BTMRH_TU16BTMR13_MASK                equ 0020h
TU16BTMRH_TU16BTMR14_POSN                equ 0006h
TU16BTMRH_TU16BTMR14_POSITION            equ 0006h
TU16BTMRH_TU16BTMR14_SIZE                equ 0001h
TU16BTMRH_TU16BTMR14_LENGTH              equ 0001h
TU16BTMRH_TU16BTMR14_MASK                equ 0040h
TU16BTMRH_TU16BTMR15_POSN                equ 0007h
TU16BTMRH_TU16BTMR15_POSITION            equ 0007h
TU16BTMRH_TU16BTMR15_SIZE                equ 0001h
TU16BTMRH_TU16BTMR15_LENGTH              equ 0001h
TU16BTMRH_TU16BTMR15_MASK                equ 0080h

// Register: TU16BCRH
#define TU16BCRH TU16BCRH
TU16BCRH                                 equ 03AFh
// bitfield definitions
TU16BCRH_CRH_POSN                        equ 0000h
TU16BCRH_CRH_POSITION                    equ 0000h
TU16BCRH_CRH_SIZE                        equ 0008h
TU16BCRH_CRH_LENGTH                      equ 0008h
TU16BCRH_CRH_MASK                        equ 00FFh
TU16BCRH_CRH0_POSN                       equ 0000h
TU16BCRH_CRH0_POSITION                   equ 0000h
TU16BCRH_CRH0_SIZE                       equ 0001h
TU16BCRH_CRH0_LENGTH                     equ 0001h
TU16BCRH_CRH0_MASK                       equ 0001h
TU16BCRH_CRH1_POSN                       equ 0001h
TU16BCRH_CRH1_POSITION                   equ 0001h
TU16BCRH_CRH1_SIZE                       equ 0001h
TU16BCRH_CRH1_LENGTH                     equ 0001h
TU16BCRH_CRH1_MASK                       equ 0002h
TU16BCRH_CRH2_POSN                       equ 0002h
TU16BCRH_CRH2_POSITION                   equ 0002h
TU16BCRH_CRH2_SIZE                       equ 0001h
TU16BCRH_CRH2_LENGTH                     equ 0001h
TU16BCRH_CRH2_MASK                       equ 0004h
TU16BCRH_CRH3_POSN                       equ 0003h
TU16BCRH_CRH3_POSITION                   equ 0003h
TU16BCRH_CRH3_SIZE                       equ 0001h
TU16BCRH_CRH3_LENGTH                     equ 0001h
TU16BCRH_CRH3_MASK                       equ 0008h
TU16BCRH_CRH4_POSN                       equ 0004h
TU16BCRH_CRH4_POSITION                   equ 0004h
TU16BCRH_CRH4_SIZE                       equ 0001h
TU16BCRH_CRH4_LENGTH                     equ 0001h
TU16BCRH_CRH4_MASK                       equ 0010h
TU16BCRH_CRH5_POSN                       equ 0005h
TU16BCRH_CRH5_POSITION                   equ 0005h
TU16BCRH_CRH5_SIZE                       equ 0001h
TU16BCRH_CRH5_LENGTH                     equ 0001h
TU16BCRH_CRH5_MASK                       equ 0020h
TU16BCRH_CRH6_POSN                       equ 0006h
TU16BCRH_CRH6_POSITION                   equ 0006h
TU16BCRH_CRH6_SIZE                       equ 0001h
TU16BCRH_CRH6_LENGTH                     equ 0001h
TU16BCRH_CRH6_MASK                       equ 0040h
TU16BCRH_CRH7_POSN                       equ 0007h
TU16BCRH_CRH7_POSITION                   equ 0007h
TU16BCRH_CRH7_SIZE                       equ 0001h
TU16BCRH_CRH7_LENGTH                     equ 0001h
TU16BCRH_CRH7_MASK                       equ 0080h
TU16BCRH_TU16BCRH0_POSN                  equ 0000h
TU16BCRH_TU16BCRH0_POSITION              equ 0000h
TU16BCRH_TU16BCRH0_SIZE                  equ 0001h
TU16BCRH_TU16BCRH0_LENGTH                equ 0001h
TU16BCRH_TU16BCRH0_MASK                  equ 0001h
TU16BCRH_TU16BCRH1_POSN                  equ 0001h
TU16BCRH_TU16BCRH1_POSITION              equ 0001h
TU16BCRH_TU16BCRH1_SIZE                  equ 0001h
TU16BCRH_TU16BCRH1_LENGTH                equ 0001h
TU16BCRH_TU16BCRH1_MASK                  equ 0002h
TU16BCRH_TU16BCRH2_POSN                  equ 0002h
TU16BCRH_TU16BCRH2_POSITION              equ 0002h
TU16BCRH_TU16BCRH2_SIZE                  equ 0001h
TU16BCRH_TU16BCRH2_LENGTH                equ 0001h
TU16BCRH_TU16BCRH2_MASK                  equ 0004h
TU16BCRH_TU16BCRH3_POSN                  equ 0003h
TU16BCRH_TU16BCRH3_POSITION              equ 0003h
TU16BCRH_TU16BCRH3_SIZE                  equ 0001h
TU16BCRH_TU16BCRH3_LENGTH                equ 0001h
TU16BCRH_TU16BCRH3_MASK                  equ 0008h
TU16BCRH_TU16BCRH4_POSN                  equ 0004h
TU16BCRH_TU16BCRH4_POSITION              equ 0004h
TU16BCRH_TU16BCRH4_SIZE                  equ 0001h
TU16BCRH_TU16BCRH4_LENGTH                equ 0001h
TU16BCRH_TU16BCRH4_MASK                  equ 0010h
TU16BCRH_TU16BCRH5_POSN                  equ 0005h
TU16BCRH_TU16BCRH5_POSITION              equ 0005h
TU16BCRH_TU16BCRH5_SIZE                  equ 0001h
TU16BCRH_TU16BCRH5_LENGTH                equ 0001h
TU16BCRH_TU16BCRH5_MASK                  equ 0020h
TU16BCRH_TU16BCRH6_POSN                  equ 0006h
TU16BCRH_TU16BCRH6_POSITION              equ 0006h
TU16BCRH_TU16BCRH6_SIZE                  equ 0001h
TU16BCRH_TU16BCRH6_LENGTH                equ 0001h
TU16BCRH_TU16BCRH6_MASK                  equ 0040h
TU16BCRH_TU16BCRH7_POSN                  equ 0007h
TU16BCRH_TU16BCRH7_POSITION              equ 0007h
TU16BCRH_TU16BCRH7_SIZE                  equ 0001h
TU16BCRH_TU16BCRH7_LENGTH                equ 0001h
TU16BCRH_TU16BCRH7_MASK                  equ 0080h
TU16BCRH_TU16BCR8_POSN                   equ 0000h
TU16BCRH_TU16BCR8_POSITION               equ 0000h
TU16BCRH_TU16BCR8_SIZE                   equ 0001h
TU16BCRH_TU16BCR8_LENGTH                 equ 0001h
TU16BCRH_TU16BCR8_MASK                   equ 0001h
TU16BCRH_TU16BCR9_POSN                   equ 0001h
TU16BCRH_TU16BCR9_POSITION               equ 0001h
TU16BCRH_TU16BCR9_SIZE                   equ 0001h
TU16BCRH_TU16BCR9_LENGTH                 equ 0001h
TU16BCRH_TU16BCR9_MASK                   equ 0002h
TU16BCRH_TU16BCR10_POSN                  equ 0002h
TU16BCRH_TU16BCR10_POSITION              equ 0002h
TU16BCRH_TU16BCR10_SIZE                  equ 0001h
TU16BCRH_TU16BCR10_LENGTH                equ 0001h
TU16BCRH_TU16BCR10_MASK                  equ 0004h
TU16BCRH_TU16BCR11_POSN                  equ 0003h
TU16BCRH_TU16BCR11_POSITION              equ 0003h
TU16BCRH_TU16BCR11_SIZE                  equ 0001h
TU16BCRH_TU16BCR11_LENGTH                equ 0001h
TU16BCRH_TU16BCR11_MASK                  equ 0008h
TU16BCRH_TU16BCR12_POSN                  equ 0004h
TU16BCRH_TU16BCR12_POSITION              equ 0004h
TU16BCRH_TU16BCR12_SIZE                  equ 0001h
TU16BCRH_TU16BCR12_LENGTH                equ 0001h
TU16BCRH_TU16BCR12_MASK                  equ 0010h
TU16BCRH_TU16BCR13_POSN                  equ 0005h
TU16BCRH_TU16BCR13_POSITION              equ 0005h
TU16BCRH_TU16BCR13_SIZE                  equ 0001h
TU16BCRH_TU16BCR13_LENGTH                equ 0001h
TU16BCRH_TU16BCR13_MASK                  equ 0020h
TU16BCRH_TU16BCR14_POSN                  equ 0006h
TU16BCRH_TU16BCR14_POSITION              equ 0006h
TU16BCRH_TU16BCR14_SIZE                  equ 0001h
TU16BCRH_TU16BCR14_LENGTH                equ 0001h
TU16BCRH_TU16BCR14_MASK                  equ 0040h
TU16BCRH_TU16BCR15_POSN                  equ 0007h
TU16BCRH_TU16BCR15_POSITION              equ 0007h
TU16BCRH_TU16BCR15_SIZE                  equ 0001h
TU16BCRH_TU16BCR15_LENGTH                equ 0001h
TU16BCRH_TU16BCR15_MASK                  equ 0080h

// Register: TU16BPR
#define TU16BPR TU16BPR
TU16BPR                                  equ 03B0h

