garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f25q71.inc
// Register: IOCEF
#define IOCEF IOCEF
IOCEF                                    equ 0427h
// bitfield definitions
IOCEF_IOCEF3_POSN                        equ 0003h
IOCEF_IOCEF3_POSITION                    equ 0003h
IOCEF_IOCEF3_SIZE                        equ 0001h
IOCEF_IOCEF3_LENGTH                      equ 0001h
IOCEF_IOCEF3_MASK                        equ 0008h

// Register: IOCWP
#define IOCWP IOCWP
IOCWP                                    equ 043Dh
// bitfield definitions
IOCWP_IOCWP0_POSN                        equ 0000h
IOCWP_IOCWP0_POSITION                    equ 0000h
IOCWP_IOCWP0_SIZE                        equ 0001h
IOCWP_IOCWP0_LENGTH                      equ 0001h
IOCWP_IOCWP0_MASK                        equ 0001h
IOCWP_IOCWP1_POSN                        equ 0001h
IOCWP_IOCWP1_POSITION                    equ 0001h
IOCWP_IOCWP1_SIZE                        equ 0001h
IOCWP_IOCWP1_LENGTH                      equ 0001h
IOCWP_IOCWP1_MASK                        equ 0002h
IOCWP_IOCWP2_POSN                        equ 0002h
IOCWP_IOCWP2_POSITION                    equ 0002h
IOCWP_IOCWP2_SIZE                        equ 0001h
IOCWP_IOCWP2_LENGTH                      equ 0001h
IOCWP_IOCWP2_MASK                        equ 0004h
IOCWP_IOCWP3_POSN                        equ 0003h
IOCWP_IOCWP3_POSITION                    equ 0003h
IOCWP_IOCWP3_SIZE                        equ 0001h
IOCWP_IOCWP3_LENGTH                      equ 0001h
IOCWP_IOCWP3_MASK                        equ 0008h
IOCWP_IOCWP4_POSN                        equ 0004h
IOCWP_IOCWP4_POSITION                    equ 0004h
IOCWP_IOCWP4_SIZE                        equ 0001h
IOCWP_IOCWP4_LENGTH                      equ 0001h
IOCWP_IOCWP4_MASK                        equ 0010h
IOCWP_IOCWP5_POSN                        equ 0005h
IOCWP_IOCWP5_POSITION                    equ 0005h
IOCWP_IOCWP5_SIZE                        equ 0001h
IOCWP_IOCWP5_LENGTH                      equ 0001h
IOCWP_IOCWP5_MASK                        equ 0020h
IOCWP_IOCWP6_POSN                        equ 0006h
IOCWP_IOCWP6_POSITION                    equ 0006h
IOCWP_IOCWP6_SIZE                        equ 0001h
IOCWP_IOCWP6_LENGTH                      equ 0001h
IOCWP_IOCWP6_MASK                        equ 0040h
IOCWP_IOCWP7_POSN                        equ 0007h
IOCWP_IOCWP7_POSITION                    equ 0007h
IOCWP_IOCWP7_SIZE                        equ 0001h
IOCWP_IOCWP7_LENGTH                      equ 0001h
IOCWP_IOCWP7_MASK                        equ 0080h

// Register: IOCWN
#define IOCWN IOCWN
IOCWN                                    equ 043Eh
// bitfield definitions
IOCWN_IOCWN0_POSN                        equ 0000h
IOCWN_IOCWN0_POSITION                    equ 0000h
IOCWN_IOCWN0_SIZE                        equ 0001h
IOCWN_IOCWN0_LENGTH                      equ 0001h
IOCWN_IOCWN0_MASK                        equ 0001h
IOCWN_IOCWN1_POSN                        equ 0001h
IOCWN_IOCWN1_POSITION                    equ 0001h
IOCWN_IOCWN1_SIZE                        equ 0001h
IOCWN_IOCWN1_LENGTH                      equ 0001h
IOCWN_IOCWN1_MASK                        equ 0002h
IOCWN_IOCWN2_POSN                        equ 0002h
IOCWN_IOCWN2_POSITION                    equ 0002h
IOCWN_IOCWN2_SIZE                        equ 0001h
IOCWN_IOCWN2_LENGTH                      equ 0001h
IOCWN_IOCWN2_MASK                        equ 0004h
IOCWN_IOCWN3_POSN                        equ 0003h
IOCWN_IOCWN3_POSITION                    equ 0003h
IOCWN_IOCWN3_SIZE                        equ 0001h
IOCWN_IOCWN3_LENGTH                      equ 0001h
IOCWN_IOCWN3_MASK                        equ 0008h
IOCWN_IOCWN4_POSN                        equ 0004h
IOCWN_IOCWN4_POSITION                    equ 0004h
IOCWN_IOCWN4_SIZE                        equ 0001h
IOCWN_IOCWN4_LENGTH                      equ 0001h
IOCWN_IOCWN4_MASK                        equ 0010h
IOCWN_IOCWN5_POSN                        equ 0005h
IOCWN_IOCWN5_POSITION                    equ 0005h
IOCWN_IOCWN5_SIZE                        equ 0001h
IOCWN_IOCWN5_LENGTH                      equ 0001h
IOCWN_IOCWN5_MASK                        equ 0020h
IOCWN_IOCWN6_POSN                        equ 0006h
IOCWN_IOCWN6_POSITION                    equ 0006h
IOCWN_IOCWN6_SIZE                        equ 0001h
IOCWN_IOCWN6_LENGTH                      equ 0001h
IOCWN_IOCWN6_MASK                        equ 0040h
IOCWN_IOCWN7_POSN                        equ 0007h
IOCWN_IOCWN7_POSITION                    equ 0007h
IOCWN_IOCWN7_SIZE                        equ 0001h
IOCWN_IOCWN7_LENGTH                      equ 0001h
IOCWN_IOCWN7_MASK                        equ 0080h

// Register: IOCWF
#define IOCWF IOCWF
IOCWF                                    equ 043Fh
// bitfield definitions
IOCWF_IOCWF0_POSN                        equ 0000h
IOCWF_IOCWF0_POSITION                    equ 0000h
IOCWF_IOCWF0_SIZE                        equ 0001h
IOCWF_IOCWF0_LENGTH                      equ 0001h
IOCWF_IOCWF0_MASK                        equ 0001h
IOCWF_IOCWF1_POSN                        equ 0001h
IOCWF_IOCWF1_POSITION                    equ 0001h
IOCWF_IOCWF1_SIZE                        equ 0001h
IOCWF_IOCWF1_LENGTH                      equ 0001h
IOCWF_IOCWF1_MASK                        equ 0002h
IOCWF_IOCWF2_POSN                        equ 0002h
IOCWF_IOCWF2_POSITION                    equ 0002h
IOCWF_IOCWF2_SIZE                        equ 0001h
IOCWF_IOCWF2_LENGTH                      equ 0001h
IOCWF_IOCWF2_MASK                        equ 0004h
IOCWF_IOCWF3_POSN                        equ 0003h
IOCWF_IOCWF3_POSITION                    equ 0003h
IOCWF_IOCWF3_SIZE                        equ 0001h
IOCWF_IOCWF3_LENGTH                      equ 0001h
IOCWF_IOCWF3_MASK                        equ 0008h
IOCWF_IOCWF4_POSN                        equ 0004h
IOCWF_IOCWF4_POSITION                    equ 0004h
IOCWF_IOCWF4_SIZE                        equ 0001h
IOCWF_IOCWF4_LENGTH                      equ 0001h
IOCWF_IOCWF4_MASK                        equ 0010h
IOCWF_IOCWF5_POSN                        equ 0005h
IOCWF_IOCWF5_POSITION                    equ 0005h
IOCWF_IOCWF5_SIZE                        equ 0001h
IOCWF_IOCWF5_LENGTH                      equ 0001h
IOCWF_IOCWF5_MASK                        equ 0020h
IOCWF_IOCWF6_POSN                        equ 0006h
IOCWF_IOCWF6_POSITION                    equ 0006h
IOCWF_IOCWF6_SIZE                        equ 0001h
IOCWF_IOCWF6_LENGTH                      equ 0001h
IOCWF_IOCWF6_MASK                        equ 0040h
IOCWF_IOCWF7_POSN                        equ 0007h
IOCWF_IOCWF7_POSITION                    equ 0007h
IOCWF_IOCWF7_SIZE                        equ 0001h
IOCWF_IOCWF7_LENGTH                      equ 0001h
IOCWF_IOCWF7_MASK                        equ 0080h

// Register: NCO1ACC
#define NCO1ACC NCO1ACC
NCO1ACC                                  equ 0440h

