garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f25q71.inc
// Register: PIR5
#define PIR5 PIR5
PIR5                                     equ 04B7h
// bitfield definitions
PIR5_CLC6IF_POSN                         equ 0001h
PIR5_CLC6IF_POSITION                     equ 0001h
PIR5_CLC6IF_SIZE                         equ 0001h
PIR5_CLC6IF_LENGTH                       equ 0001h
PIR5_CLC6IF_MASK                         equ 0002h
PIR5_TU16AIF_POSN                        equ 0002h
PIR5_TU16AIF_POSITION                    equ 0002h
PIR5_TU16AIF_SIZE                        equ 0001h
PIR5_TU16AIF_LENGTH                      equ 0001h
PIR5_TU16AIF_MASK                        equ 0004h
PIR5_C2IF_POSN                           equ 0004h
PIR5_C2IF_POSITION                       equ 0004h
PIR5_C2IF_SIZE                           equ 0001h
PIR5_C2IF_LENGTH                         equ 0001h
PIR5_C2IF_MASK                           equ 0010h
PIR5_CLC2IF_POSN                         equ 0005h
PIR5_CLC2IF_POSITION                     equ 0005h
PIR5_CLC2IF_SIZE                         equ 0001h
PIR5_CLC2IF_LENGTH                       equ 0001h
PIR5_CLC2IF_MASK                         equ 0020h
PIR5_PWM2PIF_POSN                        equ 0006h
PIR5_PWM2PIF_POSITION                    equ 0006h
PIR5_PWM2PIF_SIZE                        equ 0001h
PIR5_PWM2PIF_LENGTH                      equ 0001h
PIR5_PWM2PIF_MASK                        equ 0040h
PIR5_PWM2IF_POSN                         equ 0007h
PIR5_PWM2IF_POSITION                     equ 0007h
PIR5_PWM2IF_SIZE                         equ 0001h
PIR5_PWM2IF_LENGTH                       equ 0001h
PIR5_PWM2IF_MASK                         equ 0080h

// Register: PIR6
#define PIR6 PIR6
PIR6                                     equ 04B8h
// bitfield definitions
PIR6_INT1IF_POSN                         equ 0000h
PIR6_INT1IF_POSITION                     equ 0000h
PIR6_INT1IF_SIZE                         equ 0001h
PIR6_INT1IF_LENGTH                       equ 0001h
PIR6_INT1IF_MASK                         equ 0001h
PIR6_CLC7IF_POSN                         equ 0001h
PIR6_CLC7IF_POSITION                     equ 0001h
PIR6_CLC7IF_SIZE                         equ 0001h
PIR6_CLC7IF_LENGTH                       equ 0001h
PIR6_CLC7IF_MASK                         equ 0002h
PIR6_CWG1IF_POSN                         equ 0002h
PIR6_CWG1IF_POSITION                     equ 0002h
PIR6_CWG1IF_SIZE                         equ 0001h
PIR6_CWG1IF_LENGTH                       equ 0001h
PIR6_CWG1IF_MASK                         equ 0004h
PIR6_NCO1IF_POSN                         equ 0003h
PIR6_NCO1IF_POSITION                     equ 0003h
PIR6_NCO1IF_SIZE                         equ 0001h
PIR6_NCO1IF_LENGTH                       equ 0001h
PIR6_NCO1IF_MASK                         equ 0008h
PIR6_DMA2SCNTIF_POSN                     equ 0004h
PIR6_DMA2SCNTIF_POSITION                 equ 0004h
PIR6_DMA2SCNTIF_SIZE                     equ 0001h
PIR6_DMA2SCNTIF_LENGTH                   equ 0001h
PIR6_DMA2SCNTIF_MASK                     equ 0010h
PIR6_DMA2DCNTIF_POSN                     equ 0005h
PIR6_DMA2DCNTIF_POSITION                 equ 0005h
PIR6_DMA2DCNTIF_SIZE                     equ 0001h
PIR6_DMA2DCNTIF_LENGTH                   equ 0001h
PIR6_DMA2DCNTIF_MASK                     equ 0020h
PIR6_DMA2ORIF_POSN                       equ 0006h
PIR6_DMA2ORIF_POSITION                   equ 0006h
PIR6_DMA2ORIF_SIZE                       equ 0001h
PIR6_DMA2ORIF_LENGTH                     equ 0001h
PIR6_DMA2ORIF_MASK                       equ 0040h
PIR6_DMA2AIF_POSN                        equ 0007h
PIR6_DMA2AIF_POSITION                    equ 0007h
PIR6_DMA2AIF_SIZE                        equ 0001h
PIR6_DMA2AIF_LENGTH                      equ 0001h
PIR6_DMA2AIF_MASK                        equ 0080h

// Register: PIR7
#define PIR7 PIR7
PIR7                                     equ 04B9h
// bitfield definitions
PIR7_I2C1RXIF_POSN                       equ 0000h
PIR7_I2C1RXIF_POSITION                   equ 0000h
PIR7_I2C1RXIF_SIZE                       equ 0001h
PIR7_I2C1RXIF_LENGTH                     equ 0001h
PIR7_I2C1RXIF_MASK                       equ 0001h
PIR7_I2C1TXIF_POSN                       equ 0001h
PIR7_I2C1TXIF_POSITION                   equ 0001h
PIR7_I2C1TXIF_SIZE                       equ 0001h
PIR7_I2C1TXIF_LENGTH                     equ 0001h
PIR7_I2C1TXIF_MASK                       equ 0002h
PIR7_I2C1IF_POSN                         equ 0002h
PIR7_I2C1IF_POSITION                     equ 0002h
PIR7_I2C1IF_SIZE                         equ 0001h
PIR7_I2C1IF_LENGTH                       equ 0001h
PIR7_I2C1IF_MASK                         equ 0004h
PIR7_I2C1EIF_POSN                        equ 0003h
PIR7_I2C1EIF_POSITION                    equ 0003h
PIR7_I2C1EIF_SIZE                        equ 0001h
PIR7_I2C1EIF_LENGTH                      equ 0001h
PIR7_I2C1EIF_MASK                        equ 0008h
PIR7_CLC3IF_POSN                         equ 0005h
PIR7_CLC3IF_POSITION                     equ 0005h
PIR7_CLC3IF_SIZE                         equ 0001h
PIR7_CLC3IF_LENGTH                       equ 0001h
PIR7_CLC3IF_MASK                         equ 0020h
PIR7_PWM3PIF_POSN                        equ 0006h
PIR7_PWM3PIF_POSITION                    equ 0006h
PIR7_PWM3PIF_SIZE                        equ 0001h
PIR7_PWM3PIF_LENGTH                      equ 0001h
PIR7_PWM3PIF_MASK                        equ 0040h
PIR7_PWM3IF_POSN                         equ 0007h
PIR7_PWM3IF_POSITION                     equ 0007h
PIR7_PWM3IF_SIZE                         equ 0001h
PIR7_PWM3IF_LENGTH                       equ 0001h
PIR7_PWM3IF_MASK                         equ 0080h

// Register: PIR8
#define PIR8 PIR8
PIR8                                     equ 04BAh
// bitfield definitions
PIR8_U2RXIF_POSN                         equ 0000h
PIR8_U2RXIF_POSITION                     equ 0000h
PIR8_U2RXIF_SIZE                         equ 0001h
PIR8_U2RXIF_LENGTH                       equ 0001h
PIR8_U2RXIF_MASK                         equ 0001h
PIR8_U2TXIF_POSN                         equ 0001h
PIR8_U2TXIF_POSITION                     equ 0001h
PIR8_U2TXIF_SIZE                         equ 0001h
PIR8_U2TXIF_LENGTH                       equ 0001h
PIR8_U2TXIF_MASK                         equ 0002h
PIR8_U2EIF_POSN                          equ 0002h
PIR8_U2EIF_POSITION                      equ 0002h
PIR8_U2EIF_SIZE                          equ 0001h
PIR8_U2EIF_LENGTH                        equ 0001h
PIR8_U2EIF_MASK                          equ 0004h
PIR8_U2IF_POSN                           equ 0003h
PIR8_U2IF_POSITION                       equ 0003h
PIR8_U2IF_SIZE                           equ 0001h
PIR8_U2IF_LENGTH                         equ 0001h
PIR8_U2IF_MASK                           equ 0008h
PIR8_CLC4IF_POSN                         equ 0005h
PIR8_CLC4IF_POSITION                     equ 0005h
PIR8_CLC4IF_SIZE                         equ 0001h
PIR8_CLC4IF_LENGTH                       equ 0001h
PIR8_CLC4IF_MASK                         equ 0020h
PIR8_CCP2IF_POSN                         equ 0006h
PIR8_CCP2IF_POSITION                     equ 0006h
PIR8_CCP2IF_SIZE                         equ 0001h
PIR8_CCP2IF_LENGTH                       equ 0001h
PIR8_CCP2IF_MASK                         equ 0040h
PIR8_SCANIF_POSN                         equ 0007h
PIR8_SCANIF_POSITION                     equ 0007h
PIR8_SCANIF_SIZE                         equ 0001h
PIR8_SCANIF_LENGTH                       equ 0001h
PIR8_SCANIF_MASK                         equ 0080h

// Register: PIR9
#define PIR9 PIR9
PIR9                                     equ 04BBh
// bitfield definitions
PIR9_DMA3SCNTIF_POSN                     equ 0004h
PIR9_DMA3SCNTIF_POSITION                 equ 0004h
PIR9_DMA3SCNTIF_SIZE                     equ 0001h
PIR9_DMA3SCNTIF_LENGTH                   equ 0001h
PIR9_DMA3SCNTIF_MASK                     equ 0010h
PIR9_DMA3DCNTIF_POSN                     equ 0005h
PIR9_DMA3DCNTIF_POSITION                 equ 0005h
PIR9_DMA3DCNTIF_SIZE                     equ 0001h
PIR9_DMA3DCNTIF_LENGTH                   equ 0001h
PIR9_DMA3DCNTIF_MASK                     equ 0020h
PIR9_DMA3ORIF_POSN                       equ 0006h
PIR9_DMA3ORIF_POSITION                   equ 0006h
PIR9_DMA3ORIF_SIZE                       equ 0001h
PIR9_DMA3ORIF_LENGTH                     equ 0001h
PIR9_DMA3ORIF_MASK                       equ 0040h
PIR9_DMA3AIF_POSN                        equ 0007h
PIR9_DMA3AIF_POSITION                    equ 0007h
PIR9_DMA3AIF_SIZE                        equ 0001h
PIR9_DMA3AIF_LENGTH                      equ 0001h
PIR9_DMA3AIF_MASK                        equ 0080h

// Register: PIR10
#define PIR10 PIR10
PIR10                                    equ 04BCh
// bitfield definitions
PIR10_INT2IF_POSN                        equ 0000h
PIR10_INT2IF_POSITION                    equ 0000h
PIR10_INT2IF_SIZE                        equ 0001h
PIR10_INT2IF_LENGTH                      equ 0001h
PIR10_INT2IF_MASK                        equ 0001h
PIR10_CLC8IF_POSN                        equ 0001h
PIR10_CLC8IF_POSITION                    equ 0001h
PIR10_CLC8IF_SIZE                        equ 0001h
PIR10_CLC8IF_LENGTH                      equ 0001h
PIR10_CLC8IF_MASK                        equ 0002h
PIR10_TU16BIF_POSN                       equ 0002h
PIR10_TU16BIF_POSITION                   equ 0002h
PIR10_TU16BIF_SIZE                       equ 0001h
PIR10_TU16BIF_LENGTH                     equ 0001h
PIR10_TU16BIF_MASK                       equ 0004h
PIR10_TMR4IF_POSN                        equ 0003h
PIR10_TMR4IF_POSITION                    equ 0003h
PIR10_TMR4IF_SIZE                        equ 0001h
PIR10_TMR4IF_LENGTH                      equ 0001h
PIR10_TMR4IF_MASK                        equ 0008h
PIR10_DMA4SCNTIF_POSN                    equ 0004h
PIR10_DMA4SCNTIF_POSITION                equ 0004h
PIR10_DMA4SCNTIF_SIZE                    equ 0001h
PIR10_DMA4SCNTIF_LENGTH                  equ 0001h
PIR10_DMA4SCNTIF_MASK                    equ 0010h
PIR10_DMA4DCNTIF_POSN                    equ 0005h
PIR10_DMA4DCNTIF_POSITION                equ 0005h
PIR10_DMA4DCNTIF_SIZE                    equ 0001h
PIR10_DMA4DCNTIF_LENGTH                  equ 0001h
PIR10_DMA4DCNTIF_MASK                    equ 0020h
PIR10_DMA4ORIF_POSN                      equ 0006h
PIR10_DMA4ORIF_POSITION                  equ 0006h
PIR10_DMA4ORIF_SIZE                      equ 0001h
PIR10_DMA4ORIF_LENGTH                    equ 0001h
PIR10_DMA4ORIF_MASK                      equ 0040h
PIR10_DMA4AIF_POSN                       equ 0007h
PIR10_DMA4AIF_POSITION                   equ 0007h
PIR10_DMA4AIF_SIZE                       equ 0001h
PIR10_DMA4AIF_LENGTH                     equ 0001h
PIR10_DMA4AIF_MASK                       equ 0080h

// Register: INTCON0
#define INTCON0 INTCON0
INTCON0                                  equ 04D6h
// bitfield definitions
INTCON0_INT0EDG_POSN                     equ 0000h
INTCON0_INT0EDG_POSITION                 equ 0000h
INTCON0_INT0EDG_SIZE                     equ 0001h
INTCON0_INT0EDG_LENGTH                   equ 0001h
INTCON0_INT0EDG_MASK                     equ 0001h
INTCON0_INT1EDG_POSN                     equ 0001h
INTCON0_INT1EDG_POSITION                 equ 0001h
INTCON0_INT1EDG_SIZE                     equ 0001h
INTCON0_INT1EDG_LENGTH                   equ 0001h
INTCON0_INT1EDG_MASK                     equ 0002h
INTCON0_INT2EDG_POSN                     equ 0002h
INTCON0_INT2EDG_POSITION                 equ 0002h
INTCON0_INT2EDG_SIZE                     equ 0001h
INTCON0_INT2EDG_LENGTH                   equ 0001h
INTCON0_INT2EDG_MASK                     equ 0004h
INTCON0_IPEN_POSN                        equ 0005h
INTCON0_IPEN_POSITION                    equ 0005h
INTCON0_IPEN_SIZE                        equ 0001h
INTCON0_IPEN_LENGTH                      equ 0001h
INTCON0_IPEN_MASK                        equ 0020h
INTCON0_GIEL_POSN                        equ 0006h
INTCON0_GIEL_POSITION                    equ 0006h
INTCON0_GIEL_SIZE                        equ 0001h
INTCON0_GIEL_LENGTH                      equ 0001h
INTCON0_GIEL_MASK                        equ 0040h
INTCON0_GIE_POSN                         equ 0007h
INTCON0_GIE_POSITION                     equ 0007h
INTCON0_GIE_SIZE                         equ 0001h
INTCON0_GIE_LENGTH                       equ 0001h
INTCON0_GIE_MASK                         equ 0080h
INTCON0_GIEH_POSN                        equ 0007h
INTCON0_GIEH_POSITION                    equ 0007h
INTCON0_GIEH_SIZE                        equ 0001h
INTCON0_GIEH_LENGTH                      equ 0001h
INTCON0_GIEH_MASK                        equ 0080h

