garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f25q71.inc
#define ADUTH6                           BANKMASK(ADUTHL), 6, b
#define ADUTH7                           BANKMASK(ADUTHL), 7, b
#define ADUTH8                           BANKMASK(ADUTHH), 0, b
#define ADUTH9                           BANKMASK(ADUTHH), 1, b
#define ADUTHR                           BANKMASK(ADSTAT), 6, b
#define AIRQ0                            BANKMASK(DMAnAIRQ), 0, b
#define AIRQ1                            BANKMASK(DMAnAIRQ), 1, b
#define AIRQ2                            BANKMASK(DMAnAIRQ), 2, b
#define AIRQ3                            BANKMASK(DMAnAIRQ), 3, b
#define AIRQ4                            BANKMASK(DMAnAIRQ), 4, b
#define AIRQ5                            BANKMASK(DMAnAIRQ), 5, b
#define AIRQ6                            BANKMASK(DMAnAIRQ), 6, b
#define AIRQ7                            BANKMASK(DMAnAIRQ), 7, b
#define AIRQEN                           BANKMASK(DMAnCON0), 2, b
#define ANSELA0                          BANKMASK(ANSELA), 0, b
#define ANSELA1                          BANKMASK(ANSELA), 1, b
#define ANSELA2                          BANKMASK(ANSELA), 2, b
#define ANSELA3                          BANKMASK(ANSELA), 3, b
#define ANSELA4                          BANKMASK(ANSELA), 4, b
#define ANSELA5                          BANKMASK(ANSELA), 5, b
#define ANSELA6                          BANKMASK(ANSELA), 6, b
#define ANSELA7                          BANKMASK(ANSELA), 7, b
#define ANSELB0                          BANKMASK(ANSELB), 0, b
#define ANSELB1                          BANKMASK(ANSELB), 1, b
#define ANSELB2                          BANKMASK(ANSELB), 2, b
#define ANSELB3                          BANKMASK(ANSELB), 3, b
#define ANSELB4                          BANKMASK(ANSELB), 4, b
#define ANSELB5                          BANKMASK(ANSELB), 5, b
#define ANSELB6                          BANKMASK(ANSELB), 6, b
#define ANSELB7                          BANKMASK(ANSELB), 7, b
#define ANSELC0                          BANKMASK(ANSELC), 0, b
#define ANSELC1                          BANKMASK(ANSELC), 1, b
#define ANSELC2                          BANKMASK(ANSELC), 2, b
#define ANSELC3                          BANKMASK(ANSELC), 3, b
#define ANSELC4                          BANKMASK(ANSELC), 4, b
#define ANSELC5                          BANKMASK(ANSELC), 5, b
#define ANSELC6                          BANKMASK(ANSELC), 6, b
#define ANSELC7                          BANKMASK(ANSELC), 7, b
#define APMCLK0                          BANKMASK(APMCLK), 0, b
#define APMCLK1                          BANKMASK(APMCLK), 1, b
#define APMCLKPPS0                       BANKMASK(APMCLKPPS), 0, b
#define APMCLKPPS1                       BANKMASK(APMCLKPPS), 1, b
#define APMCLKPPS2                       BANKMASK(APMCLKPPS), 2, b
#define APMCLKPPS3                       BANKMASK(APMCLKPPS), 3, b
#define APMCLKPPS4                       BANKMASK(APMCLKPPS), 4, b
#define APMCLKPPS5                       BANKMASK(APMCLKPPS), 5, b
#define APMEN                            BANKMASK(APMCON), 7, b
#define APMMD                            BANKMASK(PMD1), 5, b
#define APMPER0                          BANKMASK(APMPERL), 0, b
#define APMPER1                          BANKMASK(APMPERL), 1, b
#define APMPER10                         BANKMASK(APMPERH), 2, b
#define APMPER11                         BANKMASK(APMPERH), 3, b
#define APMPER12                         BANKMASK(APMPERH), 4, b
#define APMPER13                         BANKMASK(APMPERH), 5, b
#define APMPER14                         BANKMASK(APMPERH), 6, b
#define APMPER15                         BANKMASK(APMPERH), 7, b
#define APMPER2                          BANKMASK(APMPERL), 2, b
#define APMPER3                          BANKMASK(APMPERL), 3, b
#define APMPER4                          BANKMASK(APMPERL), 4, b
#define APMPER5                          BANKMASK(APMPERL), 5, b
#define APMPER6                          BANKMASK(APMPERL), 6, b
#define APMPER7                          BANKMASK(APMPERL), 7, b
#define APMPER8                          BANKMASK(APMPERH), 0, b
#define APMPER9                          BANKMASK(APMPERH), 1, b
#define APMPERE1_10                      BANKMASK(APMPERE1H), 2, b
#define APMPERE1_11                      BANKMASK(APMPERE1H), 3, b
#define APMPERE1_12                      BANKMASK(APMPERE1H), 4, b
#define APMPERE1_13                      BANKMASK(APMPERE1H), 5, b
#define APMPERE1_14                      BANKMASK(APMPERE1H), 6, b
#define APMPERE1_15                      BANKMASK(APMPERE1H), 7, b
#define APMPERE1_2                       BANKMASK(APMPERE1L), 2, b
#define APMPERE1_3                       BANKMASK(APMPERE1L), 3, b
#define APMPERE1_4                       BANKMASK(APMPERE1L), 4, b
#define APMPERE1_5                       BANKMASK(APMPERE1L), 5, b
#define APMPERE1_6                       BANKMASK(APMPERE1L), 6, b
#define APMPERE1_7                       BANKMASK(APMPERE1L), 7, b
#define APMPERE1_8                       BANKMASK(APMPERE1H), 0, b
#define APMPERE1_9                       BANKMASK(APMPERE1H), 1, b
#define APMPERE2_10                      BANKMASK(APMPERE2H), 2, b
#define APMPERE2_11                      BANKMASK(APMPERE2H), 3, b
#define APMPERE2_12                      BANKMASK(APMPERE2H), 4, b
#define APMPERE2_13                      BANKMASK(APMPERE2H), 5, b
#define APMPERE2_14                      BANKMASK(APMPERE2H), 6, b
#define APMPERE2_15                      BANKMASK(APMPERE2H), 7, b
#define APMPERE2_2                       BANKMASK(APMPERE2L), 2, b
#define APMPERE2_3                       BANKMASK(APMPERE2L), 3, b
#define APMPERE2_4                       BANKMASK(APMPERE2L), 4, b
#define APMPERE2_5                       BANKMASK(APMPERE2L), 5, b
#define APMPERE2_6                       BANKMASK(APMPERE2L), 6, b
#define APMPERE2_7                       BANKMASK(APMPERE2L), 7, b
#define APMPERE2_8                       BANKMASK(APMPERE2H), 0, b
#define APMPERE2_9                       BANKMASK(APMPERE2H), 1, b
#define APMPERS1_10                      BANKMASK(APMPERS1H), 2, b
#define APMPERS1_11                      BANKMASK(APMPERS1H), 3, b
#define APMPERS1_12                      BANKMASK(APMPERS1H), 4, b
#define APMPERS1_13                      BANKMASK(APMPERS1H), 5, b
#define APMPERS1_14                      BANKMASK(APMPERS1H), 6, b
#define APMPERS1_15                      BANKMASK(APMPERS1H), 7, b
#define APMPERS1_2                       BANKMASK(APMPERS1L), 2, b
#define APMPERS1_3                       BANKMASK(APMPERS1L), 3, b
#define APMPERS1_4                       BANKMASK(APMPERS1L), 4, b
#define APMPERS1_5                       BANKMASK(APMPERS1L), 5, b
#define APMPERS1_6                       BANKMASK(APMPERS1L), 6, b
#define APMPERS1_7                       BANKMASK(APMPERS1L), 7, b
#define APMPERS1_8                       BANKMASK(APMPERS1H), 0, b
#define APMPERS1_9                       BANKMASK(APMPERS1H), 1, b
#define APMPERS2_10                      BANKMASK(APMPERS2H), 2, b
#define APMPERS2_11                      BANKMASK(APMPERS2H), 3, b
#define APMPERS2_12                      BANKMASK(APMPERS2H), 4, b
#define APMPERS2_13                      BANKMASK(APMPERS2H), 5, b
#define APMPERS2_14                      BANKMASK(APMPERS2H), 6, b
#define APMPERS2_15                      BANKMASK(APMPERS2H), 7, b
#define APMPERS2_2                       BANKMASK(APMPERS2L), 2, b
#define APMPERS2_3                       BANKMASK(APMPERS2L), 3, b
#define APMPERS2_4                       BANKMASK(APMPERS2L), 4, b
#define APMPERS2_5                       BANKMASK(APMPERS2L), 5, b
#define APMPERS2_6                       BANKMASK(APMPERS2L), 6, b
#define APMPERS2_7                       BANKMASK(APMPERS2L), 7, b
#define APMPERS2_8                       BANKMASK(APMPERS2H), 0, b
#define APMPERS2_9                       BANKMASK(APMPERS2H), 1, b
#define APMPRE0                          BANKMASK(APMPREL), 0, b
#define APMPRE1                          BANKMASK(APMPREL), 1, b
#define APMPRE10                         BANKMASK(APMPREH), 2, b
#define APMPRE11                         BANKMASK(APMPREH), 3, b
#define APMPRE12                         BANKMASK(APMPREH), 4, b
#define APMPRE13                         BANKMASK(APMPREH), 5, b
#define APMPRE14                         BANKMASK(APMPREH), 6, b
#define APMPRE15                         BANKMASK(APMPREH), 7, b
#define APMPRE2                          BANKMASK(APMPREL), 2, b
#define APMPRE3                          BANKMASK(APMPREL), 3, b
#define APMPRE4                          BANKMASK(APMPREL), 4, b
#define APMPRE5                          BANKMASK(APMPREL), 5, b
#define APMPRE6                          BANKMASK(APMPREL), 6, b
#define APMPRE7                          BANKMASK(APMPREL), 7, b
#define APMPRE8                          BANKMASK(APMPREH), 0, b
#define APMPRE9                          BANKMASK(APMPREH), 1, b
#define APMSTATUS_10                     BANKMASK(APMSTATUSH), 2, b
#define APMSTATUS_11                     BANKMASK(APMSTATUSH), 3, b
#define APMSTATUS_12                     BANKMASK(APMSTATUSH), 4, b
#define APMSTATUS_13                     BANKMASK(APMSTATUSH), 5, b
#define APMSTATUS_14                     BANKMASK(APMSTATUSH), 6, b
#define APMSTATUS_15                     BANKMASK(APMSTATUSH), 7, b
#define APMSTATUS_2                      BANKMASK(APMSTATUSL), 2, b
#define APMSTATUS_3                      BANKMASK(APMSTATUSL), 3, b
#define APMSTATUS_4                      BANKMASK(APMSTATUSL), 4, b
#define APMSTATUS_5                      BANKMASK(APMSTATUSL), 5, b
#define APMSTATUS_6                      BANKMASK(APMSTATUSL), 6, b
#define APMSTATUS_7                      BANKMASK(APMSTATUSL), 7, b
#define APMSTATUS_8                      BANKMASK(APMSTATUSH), 0, b
#define APMSTATUS_9                      BANKMASK(APMSTATUSH), 1, b
#define AS0E                             BANKMASK(CWG1AS1), 0, b
#define AS1E                             BANKMASK(CWG1AS1), 1, b
#define AS2E                             BANKMASK(CWG1AS1), 2, b
#define AS3E                             BANKMASK(CWG1AS1), 3, b
#define AS4E                             BANKMASK(CWG1AS1), 4, b
#define AS5E                             BANKMASK(CWG1AS1), 5, b
#define AS6E                             BANKMASK(CWG1AS1), 6, b
#define AS7E                             BANKMASK(CWG1AS1), 7, b
#define ASYNC                            BANKMASK(T0CON1), 4, b
#define BASE0                            BANKMASK(IVTBASEL), 0, b
#define BASE1                            BANKMASK(IVTBASEL), 1, b
#define BASE10                           BANKMASK(IVTBASEH), 2, b
#define BASE11                           BANKMASK(IVTBASEH), 3, b
#define BASE12                           BANKMASK(IVTBASEH), 4, b
#define BASE13                           BANKMASK(IVTBASEH), 5, b
#define BASE14                           BANKMASK(IVTBASEH), 6, b
#define BASE15                           BANKMASK(IVTBASEH), 7, b
#define BASE16                           BANKMASK(IVTBASEU), 0, b
#define BASE17                           BANKMASK(IVTBASEU), 1, b
#define BASE18                           BANKMASK(IVTBASEU), 2, b
#define BASE19                           BANKMASK(IVTBASEU), 3, b
#define BASE2                            BANKMASK(IVTBASEL), 2, b
#define BASE20                           BANKMASK(IVTBASEU), 4, b
#define BASE3                            BANKMASK(IVTBASEL), 3, b
#define BASE4                            BANKMASK(IVTBASEL), 4, b
#define BASE5                            BANKMASK(IVTBASEL), 5, b
#define BASE6                            BANKMASK(IVTBASEL), 6, b
#define BASE7                            BANKMASK(IVTBASEL), 7, b
#define BASE8                            BANKMASK(IVTBASEH), 0, b
#define BASE9                            BANKMASK(IVTBASEH), 1, b
#define BAUD0                            BANKMASK(SPI1BAUD), 0, b
#define BAUD1                            BANKMASK(SPI1BAUD), 1, b
#define BAUD2                            BANKMASK(SPI1BAUD), 2, b
#define BAUD3                            BANKMASK(SPI1BAUD), 3, b
#define BAUD4                            BANKMASK(SPI1BAUD), 4, b
#define BAUD5                            BANKMASK(SPI1BAUD), 5, b
#define BAUD6                            BANKMASK(SPI1BAUD), 6, b
#define BAUD7                            BANKMASK(SPI1BAUD), 7, b
#define BCL1IE                           BANKMASK(I2C1ERR), 1, b
#define BCL1IF                           BANKMASK(I2C1ERR), 5, b
#define BCLIE                            BANKMASK(I2C1ERR), 1, b
#define BCLIF                            BANKMASK(I2C1ERR), 5, b
#define BFRE                             BANKMASK(I2C1STAT0), 7, b
#define BFRET0                           BANKMASK(I2C1CON2), 0, b
#define BFRET1                           BANKMASK(I2C1CON2), 1, b
#define BMODE                            BANKMASK(SPI1CON0), 0, b
#define BOR                              BANKMASK(PCON0), 0, a
#define BORRDY                           BANKMASK(BORCON), 0, b
#define BTO1IE                           BANKMASK(I2C1ERR), 2, b
#define BTO1IF                           BANKMASK(I2C1ERR), 6, b
#define BTOC0                            BANKMASK(I2C1BTOC), 0, b
#define BTOC1                            BANKMASK(I2C1BTOC), 1, b
#define BTOC2                            BANKMASK(I2C1BTOC), 2, b
#define BTOC3                            BANKMASK(I2C1BTOC), 3, b
#define BTOIE                            BANKMASK(I2C1ERR), 2, b
#define BTOIF                            BANKMASK(I2C1ERR), 6, b
#define BUF0                             BANKMASK(DMAnBUF), 0, b
#define BUF1                             BANKMASK(DMAnBUF), 1, b
#define BUF2                             BANKMASK(DMAnBUF), 2, b
#define BUF3                             BANKMASK(DMAnBUF), 3, b
#define BUF4                             BANKMASK(DMAnBUF), 4, b
#define BUF5                             BANKMASK(DMAnBUF), 5, b
#define BUF6                             BANKMASK(DMAnBUF), 6, b
#define BUF7                             BANKMASK(DMAnBUF), 7, b
#define BURSTMD                          BANKMASK(SCANCON0), 1, b
#define C0EN                             BANKMASK(U1CON2), 3, b
#define C1EN                             BANKMASK(CM1CON0), 7, b
#define C1HYS                            BANKMASK(CM1CON0), 1, b
#define C1HYS1                           BANKMASK(CM1CON0), 2, b
#define C1IE                             BANKMASK(PIE1), 4, a
#define C1IF                             BANKMASK(PIR1), 4, a
#define C1INTN                           BANKMASK(CM1CON1), 0, b
#define C1INTP                           BANKMASK(CM1CON1), 1, b
#define C1IP                             BANKMASK(IPR1), 4, a
#define C1NCH0                           BANKMASK(CM1NCH), 0, b
#define C1NCH1                           BANKMASK(CM1NCH), 1, b
#define C1NCH2                           BANKMASK(CM1NCH), 2, b
#define C1OE                             BANKMASK(CM1CON0), 5, b
#define C1OUT                            BANKMASK(CM1CON0), 6, b
#define C1PCH0                           BANKMASK(CM1PCH), 0, b
#define C1PCH1                           BANKMASK(CM1PCH), 1, b
#define C1PCH2                           BANKMASK(CM1PCH), 2, b
#define C1POL                            BANKMASK(CM1CON0), 4, b
#define C1RDY                            BANKMASK(CM1CON1), 7, b
#define C1SP0                            BANKMASK(CM1CON1), 2, b
#define C1SP1                            BANKMASK(CM1CON1), 3, b
#define C1SYNC                           BANKMASK(CM1CON0), 0, b
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0, b
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1, b
#define C2EN                             BANKMASK(CM2CON0), 7, b
#define C2HYS                            BANKMASK(CM2CON0), 1, b
#define C2HYS1                           BANKMASK(CM2CON0), 2, b
#define C2IE                             BANKMASK(PIE5), 4, a
#define C2IF                             BANKMASK(PIR5), 4, a
#define C2INTN                           BANKMASK(CM2CON1), 0, b
#define C2INTP                           BANKMASK(CM2CON1), 1, b
#define C2IP                             BANKMASK(IPR5), 4, a
#define C2NCH0                           BANKMASK(CM2NCH), 0, b
#define C2NCH1                           BANKMASK(CM2NCH), 1, b
#define C2NCH2                           BANKMASK(CM2NCH), 2, b
#define C2OE                             BANKMASK(CM2CON0), 5, b
#define C2OUT                            BANKMASK(CM2CON0), 6, b
#define C2PCH0                           BANKMASK(CM2PCH), 0, b
#define C2PCH1                           BANKMASK(CM2PCH), 1, b
#define C2PCH2                           BANKMASK(CM2PCH), 2, b
#define C2POL                            BANKMASK(CM2CON0), 4, b
#define C2RDY                            BANKMASK(CM2CON1), 7, b
#define C2SP0                            BANKMASK(CM2CON1), 2, b
#define C2SP1                            BANKMASK(CM2CON1), 3, b
#define C2SYNC                           BANKMASK(CM2CON0), 0, b
#define C2TSEL0                          BANKMASK(CCPTMRS0), 2, b
#define C2TSEL1                          BANKMASK(CCPTMRS0), 3, b
#define CALC0                            BANKMASK(ADCON3), 4, b
#define CALC1                            BANKMASK(ADCON3), 5, b
#define CALC2                            BANKMASK(ADCON3), 6, b
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0, b
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1, b
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2, b
#define CCP1CTS3                         BANKMASK(CCP1CAP), 3, b
#define CCP1EN                           BANKMASK(CCP1CON), 7, b
#define CCP1FMT                          BANKMASK(CCP1CON), 4, b
#define CCP1IE                           BANKMASK(PIE3), 6, a
#define CCP1IF                           BANKMASK(PIR3), 6, a
#define CCP1IP                           BANKMASK(IPR3), 6, a
#define CCP1MD                           BANKMASK(PMD2), 7, b
#define CCP1MODE0                        BANKMASK(CCP1CON), 0, b
#define CCP1MODE1                        BANKMASK(CCP1CON), 1, b
#define CCP1MODE2                        BANKMASK(CCP1CON), 2, b
#define CCP1MODE3                        BANKMASK(CCP1CON), 3, b
#define CCP1OUT                          BANKMASK(CCP1CON), 5, b
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0, b
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1, b
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2, b
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3, b
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4, b
#define CCP1PPS5                         BANKMASK(CCP1PPS), 5, b
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0, b
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1, b
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2, b
#define CCP2CTS3                         BANKMASK(CCP2CAP), 3, b
#define CCP2EN                           BANKMASK(CCP2CON), 7, b
#define CCP2FMT                          BANKMASK(CCP2CON), 4, b
#define CCP2IE                           BANKMASK(PIE8), 6, a
#define CCP2IF                           BANKMASK(PIR8), 6, a
#define CCP2IP                           BANKMASK(IPR8), 6, a
#define CCP2MD                           BANKMASK(PMD6), 7, b
#define CCP2MODE0                        BANKMASK(CCP2CON), 0, b
#define CCP2MODE1                        BANKMASK(CCP2CON), 1, b
#define CCP2MODE2                        BANKMASK(CCP2CON), 2, b
#define CCP2MODE3                        BANKMASK(CCP2CON), 3, b
#define CCP2OUT                          BANKMASK(CCP2CON), 5, b
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0, b
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1, b
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2, b
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3, b
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4, b
#define CCP2PPS5                         BANKMASK(CCP2PPS), 5, b
#define CDAFVR0                          BANKMASK(FVRCON), 2, b
#define CDAFVR1                          BANKMASK(FVRCON), 3, b
#define CDIV0                            BANKMASK(OSCCON2), 0, b
#define CDIV1                            BANKMASK(OSCCON2), 1, b
#define CDIV2                            BANKMASK(OSCCON2), 2, b
#define CDIV3                            BANKMASK(OSCCON2), 3, b
#define CGA0                             BANKMASK(ADCGA), 0, b
#define CGA1                             BANKMASK(ADCGA), 1, b
#define CGA2                             BANKMASK(ADCGA), 2, b
#define CGA3                             BANKMASK(ADCGA), 3, b
#define CGA4                             BANKMASK(ADCGA), 4, b
#define CGA5                             BANKMASK(ADCGA), 5, b
#define CGA6                             BANKMASK(ADCGA), 6, b
#define CGA7                             BANKMASK(ADCGA), 7, b
#define CGB0                             BANKMASK(ADCGB), 0, b
#define CGB1                             BANKMASK(ADCGB), 1, b
#define CGB2                             BANKMASK(ADCGB), 2, b
#define CGB3                             BANKMASK(ADCGB), 3, b
#define CGB4                             BANKMASK(ADCGB), 4, b
#define CGB5                             BANKMASK(ADCGB), 5, b
#define CGB6                             BANKMASK(ADCGB), 6, b
#define CGB7                             BANKMASK(ADCGB), 7, b
#define CGC0                             BANKMASK(ADCGC), 0, b
#define CGC1                             BANKMASK(ADCGC), 1, b
#define CGC2                             BANKMASK(ADCGC), 2, b
#define CGC3                             BANKMASK(ADCGC), 3, b
#define CGC4                             BANKMASK(ADCGC), 4, b
#define CGC5                             BANKMASK(ADCGC), 5, b
#define CGC6                             BANKMASK(ADCGC), 6, b
#define CGC7                             BANKMASK(ADCGC), 7, b
#define CH16AB                           BANKMASK(TUCHAIN), 0, b
#define CKE                              BANKMASK(SPI1CON1), 6, b
#define CKP                              BANKMASK(SPI1CON1), 5, b
#define CKPS3                            BANKMASK(T0CON1), 3, b
#define CKS0                             BANKMASK(NCO1CLK), 0, b
#define CKS1                             BANKMASK(NCO1CLK), 1, b
#define CKS2                             BANKMASK(NCO1CLK), 2, b
#define CKS3                             BANKMASK(NCO1CLK), 3, b
#define CKS4                             BANKMASK(NCO1CLK), 4, b
#define CLC1IE                           BANKMASK(PIE0), 5, a
#define CLC1IF                           BANKMASK(PIR0), 5, a
#define CLC1IP                           BANKMASK(IPR0), 5, a
#define CLC1MD                           BANKMASK(PMD4), 1, b
#define CLC1OUT                          BANKMASK(CLCDATA), 0, b
#define CLC2IE                           BANKMASK(PIE5), 5, a
#define CLC2IF                           BANKMASK(PIR5), 5, a
#define CLC2IP                           BANKMASK(IPR5), 5, a
#define CLC2MD                           BANKMASK(PMD4), 2, b
#define CLC2OUT                          BANKMASK(CLCDATA), 1, b
#define CLC3IE                           BANKMASK(PIE7), 5, a
#define CLC3IF                           BANKMASK(PIR7), 5, a
#define CLC3IP                           BANKMASK(IPR7), 5, a
#define CLC3MD                           BANKMASK(PMD4), 3, b
#define CLC3OUT                          BANKMASK(CLCDATA), 2, b
#define CLC4IE                           BANKMASK(PIE8), 5, a
#define CLC4IF                           BANKMASK(PIR8), 5, a
#define CLC4IP                           BANKMASK(IPR8), 5, a
#define CLC4MD                           BANKMASK(PMD4), 4, b
#define CLC4OUT                          BANKMASK(CLCDATA), 3, b
#define CLC5IE                           BANKMASK(PIE2), 1, a
#define CLC5IF                           BANKMASK(PIR2), 1, a
#define CLC5IP                           BANKMASK(IPR2), 1, a
